MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32HG322F32/mcu.h
/** @} End of group EFM32HG322F32_Peripheral_Declaration */

/***************************************************************************//**
 * @defgroup EFM32HG322F32_BitFields EFM32HG322F32 Bit Fields
 * @{
 ******************************************************************************/

// #include "efm32hg_prs_signals.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dmareq.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dmactrl.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32HG322F32_UNLOCK EFM32HG322F32 Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */

/** @} End of group EFM32HG322F32_UNLOCK */

/** @} End of group EFM32HG322F32_BitFields */

/***************************************************************************//**
 * @defgroup EFM32HG322F32_Alternate_Function EFM32HG322F32 Alternate Function
 * @{
 ******************************************************************************/

// #include "efm32hg_af_ports.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_af_pins.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFM32HG322F32_Alternate_Function */

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to up2026-03-12
 *  @param MASK
 *       The mask for the bit field to up2026-03-12
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EFM32HG322F32 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EFM32HG322F32_H */
